'''
В файле собраны константы для управления персонажами
'''


RUN = 0  # Обозначает, что персонаж бежит
JUMP = 1  # Обозначает, что персонаж прыгает
FIGHT = 2  # Обозначает, что персонаж совершает удар
SQUAT = 3  # Обозначает, что персонаж приседает
DEAD = 8  # Обозначает, что персонаж погиб

LEFT = 4  # Обозначает, что персонаж смотрит влево
RIGHT = 5  # Обозначает, что персонаж смотрит вправо

DED_MAXIM = 6  # Обозначает, что выбран персонаж дед Максим
VURDALAK = 7  # Обозначает, что выбран персонаж Вурдалак

ALL_CHARACTERS = [DED_MAXIM, VURDALAK]  # Список персонажей
